
def get_info_noun_to_adj(ending):
    if ending in adj_noun_to_adj:
        return 'adj'
    else:
        return 'none'
def get_info_adj_ending(ending):
    if ending in adj_adj_to_adj:
        return "adj"
    elif ending in adj_comp_ending:
        return "adj_comp"
    elif ending in adj_sup_ending:
        return "adj_sup"
    else:
        return 'none'
def get_info_adj_verb_to_adj(ending):
    if ending in adj_verb_to_adj:
        return "adj"
    else:
        return 'none'
def get_info_adj_noun_to_adj(ending):
    if ending in adj_noun_to_adj:
        return "adj"
    else:
        return 'none'

adj_noun_to_adj = {'луу','туу','лүү','түү','дуу','дүү',
                   'сыз','суз','сиз','сүз',
                   'дай','тай','дой','дөй','дей','той','төй','тей',
                    'чыл','чул','чил','чүл',
                     'гы','кы','ки','ги',
                     'лык','дык','дүк','лүк','лик','лук','дук','дик','тык',
                     'лаш','леш','лош','лөш','даш','деш','дош','дөш','теш','таш',
                     'чан','чен','чон','чөн',
                     'дак','так',
                     'мер','мөр',
                     'кор','көр',
                     'кер','көр',
                     'көй',
                     'поз','боз',
                     'дар',
                     'кел','саак',
                     'ий','ый' #?
                     }
adj_verb_to_adj = {'гыч','гич','гүч','гуч','кыч','кич','күч','куч',
                       'ыңкы','өңкү','үңкү','иңки',
                       'ык','ук','үк','ик','өк', 'к', #?
                       'гыр','күр',
                       'чаак', 'чээк',
                       'көлөк','калак','калаң', #уганаак
                       'гыс','кыс','гүс','күс', #гы + сыз
                       'гын','гин','күн','кын',
                       'арман','ерман','өрмөн','ормон', #ар + ман
                       'анаак','өнөөк','енээк', #аган + ак
                       'ма', 'мо','мө','ме',
                       'ынды','анды','унду','инди',
                       'ыш','ош',
                       'аак','ээк',
                       'гак','гок'}
adj_adj_to_adj = {'гыл','гил',
                     'гылт','гулт','гүлт',
                     'гылтым','гүлтүм','гултум',
                     'ылжым','үлжүм', #каралжым
                     'ылтыр','үлтүр',
                     'ыш','үш',
                     'гыч',
                     'омук','омтук',
                     'чыл','чүл',
                     'ча'

                    }
adj_comp_ending = {'ыраак','ураак','раак','рээк','үрөөк','ирээк','араак','рөөк'}
adj_sup_word = {'эң','өтө','абдан','эбегейсиз','ашкан','мүлдө','чымкый','чылк'}
adj_sup_ending = {'кап','кып'}

adj_pst_koshmok_words= {'кара күрөң','кара тору','кара көк','ак куба','жашыл ала','сары ала','көк ала',
                        'кызыл ала','кара кашка','жээрде кашка','ак пейил','ак көңүл','кара көз','кырдач мурун',
                        'теке сакал','кыргый кабак','ак жуумал'}