
def get_info_adv_ending(ending):
    if ending in adv_ending:
        return "adv"
    else:
        return "none"

adv_ending = {
        'ча','че','ша','ше','чө',   #кыргызча
        'лап','леп','теп','деп','дап','тап','дөп','төп','тап',  #айлап
        'чылап','чилеп','чалап',
        'дай','тай','дой','дөй','дей','той','төй','тей','лай',  #акчалай
        'лата','дете',  #
        'чалык','чолук','чөлүк','челик',    #ушунчалык
        'сын','син','сүн',  #кышкысын
        #'ындасы','дөсү','индеси','үндөсү', #- диалект сөздөр (кышындасы)
        'ата',
        'та'
}
adv_mini_words = {
    'бир','ар','эч' #бир күнү, бир паста, ар дайым, эч качан
}
